In [1]:
import pandas as pd
from sqlalchemy import create_engine
import datetime as dt

In [2]:
airline_file = "Data/airlines.csv"
airline_df = pd.read_csv(airline_file)
airline_df.head()

,Airline ID,Name,Alias,IATA,ICAO,Callsign,Country,Active
0,-1,Unknown,\N,-,NaN,\N,\N,Y
1,1,Private flight,\N,-,NaN,NaN,NaN,Y
2,2,135 Airways,\N,NaN,GNL,GENERAL,United States,N
3,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y
4,4,2 Sqn No 1 Elementary Flying Training School,\N,NaN,WYT,NaN,United Kingdom,N

In [3]:
# Changing the names of columns and filtering columns we require
airline_clean_df = airline_df[["Airline ID", "Name", "IATA", "ICAO", "Country", "Active"]].copy()
airline_clean_df = airline_clean_df.rename(columns = {"Name": "Operator"})
airline_clean_df

,Airline ID,Operator,IATA,ICAO,Country,Active
0,-1,Unknown,-,NaN,\N,Y
1,1,Private flight,-,NaN,NaN,Y
2,2,135 Airways,NaN,GNL,United States,N
3,3,1Time Airline,1T,RNX,South Africa,Y
4,4,2 Sqn No 1 Elementary Flying Training School,NaN,WYT,United Kingdom,N
...,...,...,...,...,...,...
6157,21248,GX Airlines,NaN,CBG,China,Y
6158,21251,Lynx Aviation (L3/SSX),NaN,SSX,United States,N
6159,21268,Jetgo Australia,JG,\N,Australia,Y
6160,21270,Air Carnival,2S,\N,India,Y
6161,21317,Svyaz Rossiya,7R,SJM,Russia,Y

In [4]:
# Changing the name of Airlines in the Airlines.csv
airline_clean_df = airline_clean_df.replace({'Aeroflot Russian Airlines': 'Aeroflot',
                                            'Avianca - Aerovias Nacionales de Colombia': 'Avianca',
                                            'Private flight': 'Private'})
airline_clean_df

,Airline ID,Operator,IATA,ICAO,Country,Active
0,-1,Unknown,-,NaN,\N,Y
1,1,Private,-,NaN,NaN,Y
2,2,135 Airways,NaN,GNL,United States,N
3,3,1Time Airline,1T,RNX,South Africa,Y
4,4,2 Sqn No 1 Elementary Flying Training School,NaN,WYT,United Kingdom,N
...,...,...,...,...,...,...
6157,21248,GX Airlines,NaN,CBG,China,Y
6158,21251,Lynx Aviation (L3/SSX),NaN,SSX,United States,N
6159,21268,Jetgo Australia,JG,\N,Australia,Y
6160,21270,Air Carnival,2S,\N,India,Y
6161,21317,Svyaz Rossiya,7R,SJM,Russia,Y

In [5]:
# airline_clean_df['Active'] = airline_clean_df['Active'].replace({'n': 'N'})
# airline_clean_df

In [6]:
# Checking if the Operator names have been changed
airline_clean_df.loc[airline_clean_df['Operator'] == 'Avianca']

     Airline ID Operator IATA ICAO  Country Active
515         515  Avianca   AV  AVA  AVIANCA      Y

In [7]:
# Changing the names of Countries
airline_clean_df = airline_clean_df.replace({'ALASKA': 'United States',
                                                        'AVIANCA': 'Colombia',
                                                        'Russia]]': 'Russia'
                                                        })
airline_clean_df

,Airline ID,Operator,IATA,ICAO,Country,Active
0,-1,Unknown,-,NaN,\N,Y
1,1,Private,-,NaN,NaN,Y
2,2,135 Airways,NaN,GNL,United States,N
3,3,1Time Airline,1T,RNX,South Africa,Y
4,4,2 Sqn No 1 Elementary Flying Training School,NaN,WYT,United Kingdom,N
...,...,...,...,...,...,...
6157,21248,GX Airlines,NaN,CBG,China,Y
6158,21251,Lynx Aviation (L3/SSX),NaN,SSX,United States,N
6159,21268,Jetgo Australia,JG,\N,Australia,Y
6160,21270,Air Carnival,2S,\N,India,Y
6161,21317,Svyaz Rossiya,7R,SJM,Russia,Y

In [8]:
# Checking to see if the Country names have been changed
airline_clean_df.loc[airline_clean_df['Country'] == 'ALASKA']

Empty DataFrame
Columns: [Airline ID, Operator, IATA, ICAO, Country, Active]
Index: []

In [9]:
# # Resetin the index for airline_clean_df
# airline_clean_df = airline_clean_df.reset_index()
# # airline_clean_df = airline_df[["Airline ID", "Name", "Country", "Active"]]
# airline_clean_df

In [10]:
airline_clean_df.loc[airline_clean_df['Operator'] == 'Aeroflot']

     Airline ID  Operator IATA ICAO Country Active
130         130  Aeroflot   SU  AFL  Russia      Y

In [11]:
# airline_clean_df['Operator'].drop_duplicates()

In [12]:
# airline_clean_df['Operator'].value_counts().head(50)

In [13]:
crash_file = "Data/Airplane_Crashes_and_Fatalities_Since_1908.csv"
crash_df = pd.read_csv(crash_file)
crash_df.head()

,Date,Time,Location,Operator,Flight #,Route,Type,Registration,cn/In,Aboard,Fatalities,Ground,Summary
0,09/17/1908,17:18,"Fort Myer, Virginia",Military - U.S. Army,NaN,Demonstration,Wright Flyer III,NaN,1,2.0,1.0,0.0,"During a demonstration flight, a U.S. Army fly..."
1,7/12/1912,6:30,"AtlantiCity, New Jersey",Military - U.S. Navy,NaN,Test flight,Dirigible,NaN,NaN,5.0,5.0,0.0,First U.S. dirigible Akron exploded just offsh...
2,8/06/1913,NaN,"Victoria, British Columbia, Canada",Private,-,NaN,Curtiss seaplane,NaN,NaN,1.0,1.0,0.0,The first fatal airplane accident in Canada oc...
3,9/09/1913,18:30,Over the North Sea,Military - German Navy,NaN,NaN,Zeppelin L-1 (airship),NaN,NaN,20.0,14.0,0.0,The airship flew into a thunderstorm and encou...
4,10/17/1913,10:30,"Near Johannisthal, Germany",Military - German Navy,NaN,NaN,Zeppelin L-2 (airship),NaN,NaN,30.0,30.0,0.0,Hydrogen gas which was being vented was sucked...

In [14]:
crash_clean_df = crash_df[["Date", "Location", "Operator", "Type", "Aboard", "Fatalities", "Summary"]].copy()
crash_clean_df["Date"] = pd.to_datetime(crash_clean_df["Date"])
crash_clean_df = crash_clean_df[crash_clean_df["Date"].dt.year >= 1970]

crash_clean_df = crash_clean_df.reset_index()

In [15]:
# # All the crashes with two or more collisions, still trying a way to separating the two operators
# crash_clean_df[crash_clean_df['Operator'].str.contains('/', na=False)]

In [16]:
# Attempting the resolve how to split the two collision rows
# crash_clean_df['Operator', 'Type'] = crash_clean_df['Operator', 'Type'].str.split("/") 
# crash_clean_df.explode('Operator', 'Type').reset_index(drop=False)

In [17]:
crash_clean_df.head()

,index,Date,Location,Operator,Type,Aboard,Fatalities,Summary
0,1237,1970-02-13,"Pin-la-Garenne, France",Avia-Taxi,Cessna 402,10.0,10.0,NaN
1,1643,1973-05-11,"Near Semipalatinsk, USSR",Aeroflot,Ilyushin IL-18B,61.0,61.0,NaN
2,1807,1973-10-12,"Acapulco, Mexico",Avionas Banamex,de Havilland DH-125-1A,8.0,8.0,Crashed while approaching to land.
3,1965,1973-10-15,"Fort Smith AFB, Oklahoma",Military - U.S. Air Force,Lockheed C-130E Hercules,7.0,7.0,Crashed into a mountain.
4,2003,1975-07-31,"Santiago, Chili",Military - Chilian Air Force,Douglas C-47,10.0,10.0,NaN

In [18]:
# crash_clean_df.iloc[80:100]

In [19]:
# Renaming Airlines so they match with the two datasets
crash_clean_df = crash_clean_df.replace({'United Air Lines': 'United Airlines',
                                         'AVIANCA': 'Avianca',
                                         'Varig': ' Varig Log',
                                         'Compania Dominicana de Aviacion': 'Dominicana de Aviaci',
                                         'Aviogenex (Yugoslavia)': 'Aviogenex',
                                         'Stirling Airways': 'Stirling Airlines',
                                         'Japan Air Lines': 'Japan Airlines',
                                         'Cathay PacifiAirways': 'Cathay Pacific',
                                         'British European Airways': 'British Airways',
                                         'Spantax': 'Spantax S.A.',
                                         'Eastern Air Lines': 'Balitmore Airways',
                                         'Alia Royal Jordanian Airlines': ' Royal Jordanian',
                                         'Libya Arab Airlines': ' Libyan Airlines',
                                         'Turkish Airlines(THY)': 'Turkish Airlines',
                                         'Martinair Holland NV': 'Martinair',
                                         'Ceskoslevenske Aerolinie': 'Czech Airlines',
                                         'Inex Adria Aviopromet': 'Adria Airways',
                                         'TAP (Air Portugal)': 'TAP Portugal',
                                         'Air India': 'Air India Limited',
                                         'Loftledidir IcelandiAirlines': 'Icelandair',
                                         'Iran National Airlines': 'Iran Air',
                                         'Dan Air Services': 'Dan-Air London',
                                         'Korean Airlines': ' Korean Air',
                                         'Arrow Airways': 'Arrow Air',
                                         'Mexicana': 'Mexicana de Aviaci',
                                         'Thai Airways': 'Thai Airways International',
                                         'Tajikistan Airlines': 'Tajikistan International Airlines',
                                         'Cebu PacifiAir': ' Cebu Pacific',
                                         'China Airlines (Taiwan)': 'China Airlines',
                                         'EgyptAir': 'Egyptair',
                                         'Scandinavian Airlines (SAS)': 'Scandinavian Airlines System',
                                         'Flash Air': 'Flash Airlines',
                                         'Subir (S7)': 'S7 Airlines',
                                         'Pulkovo Airlines': 'Rossiya-Russian Airlines',
                                         'TAM (Brazil)': 'TAM Brazilian Airlines',
                                         'One-Two-Go Airlines': 'One Two Go Airlines',
                                         'Philippine Air Lines': 'Philippine Airlines',
                                         'Garuda Indonesia Airlines': 'Garuda Indonesia',
                                         'LAN': 'LAN Airlines'})

In [20]:
# Dropping the index column
crash_clean_df = crash_clean_df.drop(columns=['index'])
crash_clean_df

,Date,Location,Operator,Type,Aboard,Fatalities,Summary
0,1970-02-13,"Pin-la-Garenne, France",Avia-Taxi,Cessna 402,10.0,10.0,NaN
1,1973-05-11,"Near Semipalatinsk, USSR",Aeroflot,Ilyushin IL-18B,61.0,61.0,NaN
2,1973-10-12,"Acapulco, Mexico",Avionas Banamex,de Havilland DH-125-1A,8.0,8.0,Crashed while approaching to land.
3,1973-10-15,"Fort Smith AFB, Oklahoma",Military - U.S. Air Force,Lockheed C-130E Hercules,7.0,7.0,Crashed into a mountain.
4,1975-07-31,"Santiago, Chili",Military - Chilian Air Force,Douglas C-47,10.0,10.0,NaN
...,...,...,...,...,...,...,...
2907,2009-05-20,"Near Madiun, Indonesia",Military - Indonesian Air Force,Lockheed C-130 Hercules,112.0,98.0,"While on approach, the military transport cras..."
2908,2009-05-26,"Near Isiro, DemocratiRepubliCongo",Service Air,Antonov An-26,4.0,4.0,The cargo plane crashed while on approach to I...
2909,2009-06-01,"AtlantiOcean, 570 miles northeast of Natal, Br...",Air France,Airbus A330-203,228.0,228.0,The Airbus went missing over the AtlantiOcean ...
2910,2009-06-07,"Near Port Hope Simpson, Newfoundland, Canada",Strait Air,Britten-Norman BN-2A-27 Islander,1.0,1.0,The air ambulance crashed into hills while att...
2911,2009-06-08,"State of Arunachal Pradesh, India",Military - Indian Air Force,Antonov An-32,13.0,13.0,The military transport went missing while en r...

In [21]:
# Merging the two tables together
airline_crash_df = pd.merge(airline_clean_df, crash_clean_df, how='outer', on='Operator')
airline_crash_df

,Airline ID,Operator,IATA,ICAO,Country,Active,Date,Location,Type,Aboard,Fatalities,Summary
0,-1.0,Unknown,-,NaN,\N,Y,NaT,NaN,NaN,NaN,NaN,NaN
1,1.0,Private,-,NaN,NaN,Y,1970-10-04,"Mahaffey, Pennsylvania",Aero Commander 500-B,2.0,2.0,The aircraft crashed into a mountainside 20 mi...
2,1.0,Private,-,NaN,NaN,Y,1971-05-28,"Roanoke, Virginia",Aero Commander 680E,6.0,6.0,The flight crashed into the side of a mountain...
3,1.0,Private,-,NaN,NaN,Y,1972-09-24,"Sacramento, California",F-86 Sabrejet,1.0,0.0,A World War II vintage Sabrejet fighter leavin...
4,1.0,Private,-,NaN,NaN,Y,1972-10-16,Off the Alaska coast,Cessna 310C,4.0,4.0,The plane was on a flight from Anchorage to Ju...
...,...,...,...,...,...,...,...,...,...,...,...,...
8753,NaN,Aviastar Mandiri,NaN,NaN,NaN,NaN,2009-04-09,"Near Wamena, Indonesia",British Aerospace BAe-146-300,6.0,6.0,The cargo plane crashed into Gunung Pike mount...
8754,NaN,Mimika Air,NaN,NaN,NaN,NaN,2009-04-17,"Mount Gergaji, Indonesia",Pilatus PC-6,11.0,11.0,The passenger plane crashed in poor weather in...
8755,NaN,Aerotuy airline,NaN,NaN,NaN,NaN,2009-04-17,"Canaima National Park, Venezuela",Cessna 208B Grand Caravan,11.0,1.0,"The plane, carrying 9 tourists, crashed 5 mile..."
8756,NaN,Bako Air,NaN,NaN,NaN,NaN,2009-04-29,"Massamba, DemocratiRepubliof Congo",Boeing B-737-200,7.0,7.0,Crashed while en route on a ferrying flight. T...
8757,NaN,Strait Air,NaN,NaN,NaN,NaN,2009-06-07,"Near Port Hope Simpson, Newfoundland, Canada",Britten-Norman BN-2A-27 Islander,1.0,1.0,The air ambulance crashed into hills while att...

In [22]:
# Filling the NaN values with more meaningful data
airline_crash_df = airline_crash_df[airline_crash_df['ICAO'].notna()]
airline_crash_df = airline_crash_df[airline_crash_df['Airline ID'].notna()]
airline_crash_df = airline_crash_df[airline_crash_df['IATA'].notna()]
airline_crash_df[['Aboard', 'Fatalities']] = airline_crash_df[['Aboard', 'Fatalities']].fillna(0)
airline_crash_df[['Date', 'Location', 'Type', 'Summary']] = airline_crash_df[['Date', 'Location', 'Type', 'Summary']].fillna('No Inccident Recorded')
airline_crash_df.head(20)

,Airline ID,Operator,IATA,ICAO,Country,Active,Date,Location,Type,Aboard,Fatalities,Summary
27,3.0,1Time Airline,1T,RNX,South Africa,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
34,10.0,40-Mile Air,Q5,MLA,United States,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
37,13.0,Ansett Australia,AN,AAA,Australia,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
39,15.0,Abelag Aviation,W9,AAB,Belgium,N,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
46,21.0,Aigle Azur,ZI,AAF,France,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
47,22.0,Aloha Airlines,AQ,AAH,United States,Y,1988-04-28 00:00:00,"Maui, Hawaii",Boeing B-737-297,95.0,1.0,The aircraft suffered separation of the top of...
49,24.0,American Airlines,AA,AAL,United States,Y,1976-04-27 00:00:00,"St. Thomas, Virgin Islands",Boeing B-727-95,88.0,37.0,"After touching down 2,200 feet down the runway..."
50,24.0,American Airlines,AA,AAL,United States,Y,1979-05-25 00:00:00,"Chicago O'Hare, Illinois",McDonnell Douglas DC-10-10,271.0,271.0,"During takeoff just, as the plane lifted from ..."
51,24.0,American Airlines,AA,AAL,United States,Y,1979-11-15 00:00:00,"Near Chicago, Illinois",Boeing B-727,78.0,0.0,While en route from Chicago to Washington an e...
52,24.0,American Airlines,AA,AAL,United States,Y,1985-04-16 00:00:00,"Las Cruces, New Mexico",Boeing B-727-227,89.0,0.0,While cruising at FL 350 a loud noise was hear...
53,24.0,American Airlines,AA,AAL,United States,Y,1995-12-20 00:00:00,"Near Buga, Valle del Cauca, Colombia",Boeing B-757-223,164.0,160.0,"While on a flight from Miami, FL to Cali, Colu..."
54,24.0,American Airlines,AA,AAL,United States,Y,1999-06-01 00:00:00,"Little Rock, Arkansas",McDonnell Douglas MD-82,145.0,11.0,The plane was on a flight from Dallas/Fort Wor...
55,24.0,American Airlines,AA,AAL,United States,Y,2000-11-20 00:00:00,"Miami, Florida",Airbus A300-600R,114.0,1.0,"After climbing through 16,000 ft. the crew des..."
56,24.0,American Airlines,AA,AAL,United States,Y,2001-09-11 00:00:00,"Arlington, Virginia.",Boeing B-757-223,64.0,64.0,The aircraft was hijacked after taking off fro...
57,24.0,American Airlines,AA,AAL,United States,Y,2001-09-11 00:00:00,"New York City, New York",Boeing 767-223ER,92.0,92.0,The aircraft was hijacked shortly after it lef...
58,24.0,American Airlines,AA,AAL,United States,Y,2001-11-12 00:00:00,"Belle Harbor, Queens, New York",Airbus A-300-605R,260.0,260.0,Three minutes after taking off and while in a ...
62,28.0,Asiana Airlines,OZ,AAR,Republic of Korea,Y,1993-07-26 00:00:00,"Haenam, South Korea",Boeing B-737-5L9,110.0,68.0,The aircraft hit Mt. Ungeo at 800 ft. while on...
63,29.0,Askari Aviation,4K,AAS,Pakistan,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
66,32.0,Afriqiyah Airways,8U,AAW,Libya,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
67,33.0,Afrinat International Airlines,Q9,AFU,Gambia,N,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded

In [29]:
airline_crash_df

,Airline ID,Operator,IATA,ICAO,Country,Active,Date,Location,Type,Aboard,Fatalities,Summary
27,3.0,1Time Airline,1T,RNX,South Africa,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
34,10.0,40-Mile Air,Q5,MLA,United States,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
37,13.0,Ansett Australia,AN,AAA,Australia,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
39,15.0,Abelag Aviation,W9,AAB,Belgium,N,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
46,21.0,Aigle Azur,ZI,AAF,France,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
...,...,...,...,...,...,...,...,...,...,...,...,...
6738,21131.0,All America BOPY,0P,PYB,Paraguay,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
6740,21181.0,Air Andaman (2Y),2Y,AOW,Thailand,N,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
6744,21268.0,Jetgo Australia,JG,\N,Australia,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
6745,21270.0,Air Carnival,2S,\N,India,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
6746,21317.0,Svyaz Rossiya,7R,SJM,Russia,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded

In [39]:
# Test to see Airline values are entered 
airline_crash_df[airline_crash_df['Aboard'] >= 1]

,Airline ID,Operator,IATA,ICAO,Country,Active,Date,Location,Type,Aboard,Fatalities,Summary
47,22.0,Aloha Airlines,AQ,AAH,United States,Y,1988-04-28 00:00:00,"Maui, Hawaii",Boeing B-737-297,95.0,1.0,The aircraft suffered separation of the top of...
49,24.0,American Airlines,AA,AAL,United States,Y,1976-04-27 00:00:00,"St. Thomas, Virgin Islands",Boeing B-727-95,88.0,37.0,"After touching down 2,200 feet down the runway..."
50,24.0,American Airlines,AA,AAL,United States,Y,1979-05-25 00:00:00,"Chicago O'Hare, Illinois",McDonnell Douglas DC-10-10,271.0,271.0,"During takeoff just, as the plane lifted from ..."
51,24.0,American Airlines,AA,AAL,United States,Y,1979-11-15 00:00:00,"Near Chicago, Illinois",Boeing B-727,78.0,0.0,While en route from Chicago to Washington an e...
52,24.0,American Airlines,AA,AAL,United States,Y,1985-04-16 00:00:00,"Las Cruces, New Mexico",Boeing B-727-227,89.0,0.0,While cruising at FL 350 a loud noise was hear...
...,...,...,...,...,...,...,...,...,...,...,...,...
6115,9082.0,Uni Air,B7,UIA,Taiwan,Y,1999-08-24 00:00:00,"Hualian, Taiwan",McDonnell Douglas MD-90-30,96.0,1.0,"A fire in the front portion of the cabin, in t..."
6136,9808.0,Minerva Airlines,N4,\N,Italy,N,1999-02-25 00:00:00,"Genoa, Italy",Dornier 328-110,31.0,4.0,"The aircraft touched down briefly, overran the..."
6193,10929.0,TAN,T8,\N,Argentina,N,1973-01-27 00:00:00,"Near Tegucigalpa, Honduras",Douglas DC-6A,3.0,3.0,No Inccident Recorded
6194,10929.0,TAN,T8,\N,Argentina,N,1989-10-21 00:00:00,"Near Tegucigalpa, Honduras",Boeing B-727-224,146.0,127.0,The aircraft landed short of the runway in hea...
6549,18762.0,Lina Congo,GC,\N,Congo (Brazzaville),N,1992-03-12 00:00:00,"Etsouali, Congo",de Havilland Canada DHC-6 Twin Otter 300,8.0,3.0,Crashed during a severe thunderstorm.

In [24]:
airline_crash_df[airline_crash_df['Active'] == 'Y']

,Airline ID,Operator,IATA,ICAO,Country,Active,Date,Location,Type,Aboard,Fatalities,Summary
27,3.0,1Time Airline,1T,RNX,South Africa,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
34,10.0,40-Mile Air,Q5,MLA,United States,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
37,13.0,Ansett Australia,AN,AAA,Australia,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
46,21.0,Aigle Azur,ZI,AAF,France,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
47,22.0,Aloha Airlines,AQ,AAH,United States,Y,1988-04-28 00:00:00,"Maui, Hawaii",Boeing B-737-297,95.0,1.0,The aircraft suffered separation of the top of...
...,...,...,...,...,...,...,...,...,...,...,...,...
6733,21021.0,Nordica,EE,\N,Estonia,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
6738,21131.0,All America BOPY,0P,PYB,Paraguay,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
6744,21268.0,Jetgo Australia,JG,\N,Australia,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
6745,21270.0,Air Carnival,2S,\N,India,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
6746,21317.0,Svyaz Rossiya,7R,SJM,Russia,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded

In [41]:
airline_crash_df[airline_crash_df['Date'] == 'No Inccident Recorded']

,Airline ID,Operator,IATA,ICAO,Country,Active,Date,Location,Type,Aboard,Fatalities,Summary
27,3.0,1Time Airline,1T,RNX,South Africa,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
34,10.0,40-Mile Air,Q5,MLA,United States,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
37,13.0,Ansett Australia,AN,AAA,Australia,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
39,15.0,Abelag Aviation,W9,AAB,Belgium,N,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
46,21.0,Aigle Azur,ZI,AAF,France,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
...,...,...,...,...,...,...,...,...,...,...,...,...
6738,21131.0,All America BOPY,0P,PYB,Paraguay,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
6740,21181.0,Air Andaman (2Y),2Y,AOW,Thailand,N,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
6744,21268.0,Jetgo Australia,JG,\N,Australia,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
6745,21270.0,Air Carnival,2S,\N,India,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded
6746,21317.0,Svyaz Rossiya,7R,SJM,Russia,Y,No Inccident Recorded,No Inccident Recorded,No Inccident Recorded,0.0,0.0,No Inccident Recorded

In [25]:
# Number of crashes per Operator Country
airline_crash_df["Country"].value_counts().head(50)

United States     266
Russia            227
Canada             50
Indonesia          49
Germany            47
United Kingdom     45
France             44
Brazil             39
China              39
India              37
Australia          35
Italy              31
Japan              30
Colombia           27
Spain              27
Taiwan             26
Thailand           24
Philippines        23
Sweden             21
Mexico             20
Argentina          19
Ukraine            18
Switzerland        18
Egypt              17
Pakistan           16
South Africa       15
Ecuador            14
Austria            13
Peru               13
Portugal           13
Chile              13
Turkey             12
Netherlands        12
Romania            12
Belgium            11
Nigeria            11
Iran               11
Venezuela          10
Nepal              10
Afghanistan         9
Ethiopia            9
New Zealand         9
Singapore           9
Greece              9
Malaysia            9
Cambodia            8
Poland              8
Denmark             8
Ireland             8
Iceland             8
Name: Country, dtype: int64

In [26]:
# Number of active operators
airline_crash_df["Active"].value_counts()

Y    1374
N     495
n       1
Name: Active, dtype: int64

In [27]:
# Operators with the most crashes
airline_crash_df["Operator"].value_counts().head(50)

Aeroflot                           141
Merpati Nusantara Airlines          16
Philippine Airlines                 14
Indian Airlines                     13
Pan American World Airways          12
China Airlines                      12
Garuda Indonesia                    11
SATENA                              10
American Airlines                   10
United Airlines                     10
Tarom                                9
Egyptair                             9
Ethiopian Airlines                   9
Air France                           8
Pakistan International Airlines      8
Japan Airlines                       7
Avianca                              7
TAME                                 7
Trans World Airlines                 7
VASP                                 7
Ariana Afghan Airlines               6
Thai Airways International           6
Comair                               6
Delta Air Lines                      6
British Airways                      6
Formosa Airlines                     5
TAM Brazilian Airlines               5
LOT Polish Airlines                  5
TAAG Angola Airlines                 5
Sudan Airways                        5
Royal Nepal Airlines                 5
Continental Airlines                 4
Cameroon Airlines                    4
Air Canada                           4
National Airlines                    4
China Eastern Airlines               4
Iran Air                             4
Air India Limited                    3
Swissair                             3
Far Eastern Air Transport            3
SAETA                                3
Air Algerie                          3
Alaska Airlines                      3
Alitalia                             3
Azerbaijan Airlines                  3
Tyrolean Airways                     2
Korean Air                           2
Southwest Airlines                   2
ADC Airlines                         2
Iraqi Airways                        2
Name: Operator, dtype: int64